Repository: tux4kids/Tuxpaint-Android
Catalog: app/src/main/locale/*.po
Languages: pt_pt, tr

source: Data dir
pt_pt: Diretório de dados
tr: Veri dizini

source: Save dir
pt_pt: Diretório para guardar
tr: Kayıt dizini

source: Export dir
pt_pt: Diretório para exportar
tr: Dışa aktarım dizini

source: Language
pt_pt: Idioma
tr: Dil

# Enable_sound
source: Sound
pt_pt: Som
tr: Ses

source: Sound enabled
pt_pt: Som ativado
tr: Ses etkin

# sound_disabled
source: Silent
pt_pt: Silêncio
tr: Sessiz

# Enable_stereo
source: Stereo sound
pt_pt: Som estéreo
tr: Stereo ses

# Enable_autosave
source: Autosave when quiting
pt_pt: Guardar automaticamente ao sair
tr: Çıkışta otomatik kaydet

# autosave_enabled
source: Save on quit
pt_pt: Guardar ao sair
tr: Çıkışta kaydet

# autosave_disabled
source: Don’t save automatically on quit
pt_pt: Não guardar automaticamente ao sair
tr: Çıkışta otomatik kaydetme

# Enable_startblank
source: Start blank
pt_pt: Página em branco
tr: Boş başlat

# startblanktoggle_true
source: Start with a blank canvas
pt_pt: Começar com uma tela em branco
tr: Boş bir tuvalle başla

# startblanktoggle_false
source: Start with last draw
pt_pt: Começar pelo último desenho
tr: Son çizimle başla

# Enable_newcolorsfirst
source: "New" dialog behavior
pt_pt: Caixa de diálogo "Novo"
tr: "Yeni" penceresi davranışı

# newcolorsfirsttoggle_true
source: Colors on top
pt_pt: Cores em cima
tr: Renkler üstte

# newcolorsfirsttoggle_false
source: Images of starters and templates on top
pt_pt: Imagens em cima
tr: Başlatıcı ve şablonların görüntüleri üstte

source: Save Approach
pt_pt: Guardar
tr: Kayıt Davranışı

source: Ask
pt_pt: Perguntar
tr: Sor

source: Replace
pt_pt: Substituir
tr: Değiştir

source: New
pt_pt: Novo
tr: Yeni

# Allow_sysfonts
source: System fonts
pt_pt: Tipos de letra do sistema
tr: Sistem yazı tipleri

# sysfonts_enabled
source: Allow system fonts
pt_pt: Permitir tipos de letra do sistema
tr: Sistem yazı tiplerine izin ver

# sysfonts_disabled
source: System fonts disabled
pt_pt: Tipos de letra do sistema desativados
tr: Sistem yazı tipleri devre dışı

# Allow_printing
source: Printing
pt_pt: Impressão
tr: Yazdırma

# print_enabled
source: Allow Printing
pt_pt: Permitir impressão
tr: Yazdırmaya izin ver

# print_disabled
source: Printing disabled
pt_pt: Impressão desativada
tr: Yazdırma devre dışı

# Print_delay
source: Print delay in seconds
pt_pt: Tempo de impressão em segundos
tr: Saniye cinsinden yazdırma gecikmesi

# Disable_screen_saver
source: Screensaver
pt_pt: Protetor de ecrã
tr: Ekran koruyucu

# screensaver_disabled
source: Keep the screen on
pt_pt: Manter o ecrã ligado
tr: Ekranı açık tut

# screensaver_enabled
source: Allow Android blanking the screen
pt_pt: Permitir que o Android apague o ecrã
tr: Android ekran kapatmasına izin ver

# Orient
source: Orientation
pt_pt: Orientação
tr: Yön

# orient_portrait
source: Portrait
pt_pt: Vertical
tr: Dikey

# orient_landscape
source: Landscape
pt_pt: Horizontal
tr: Yatay

source: Button size
pt_pt: Tamanho do botão
tr: Düğme boyutu

# Colors_rows
source: Number of rows for the buttons palette
pt_pt: Número de linhas da paleta de botões
tr: Düğmeler paleti için satır sayısı

# Osk_layout
source: On screen keyboard layout
pt_pt: Disposição do teclado no ecrã
tr: Ekran klavyesi düzeni

source: Stamp rotation
pt_pt: Rotação de carimbos
tr: Pul döndürmesi

# Stamp_rotation_enabled
source: Allow stamp rotation
pt_pt: Permitir a rotação de carimbos
tr: Pul döndürmeye izin ver

# Stamp_rotation_disabled
source: Do not rotate stamps
pt_pt: Não rodar os carimbos
tr: Pullar döndürülmesin

# ok
source: Save and quit
pt_pt: Guardar e sair
tr: Kaydet ve çık

# cancel
source: Discard changes
pt_pt: Rejeitar alterações
tr: Değişiklikleri at

# Request_motivation
source: Tux Paint may need storage access in order to save your drawings.
pt_pt: O Tux Paint pode precisar de acesso ao armazenamento para guardar os teus desenhos.
tr: Tux Paint'in çizimlerinizi kaydedebilmesi için depolama erişimine ihtiyacı vardır.

# Request_btmotivation
source: Tux Paint may need Bluetooth access in order to operate properly with some external devices. Note, to revoque BT permissions or to allow them if they have been already denied you may have to do it in the Android Settings.
pt_pt: O Tux Paint pode precisar de acesso Bluetooth para funcionar corretamente com alguns dispositivos externos. Nota: para revogar as permissões de BT ou autorizá-las, caso já tenham sido recusadas, poderás ter de o fazer nas Definições do Android.
tr: Tux Paint bazı harici aygıtlarla düzgün çalışabilmek için Bluetooth erişimine ihtiyaç duyabilir. Bluetooth izinlerini geri almak veya zaten reddedilmişlerse izin vermek için bunu Android ayarlarında yapmanız gerekebilir.

# request_understood
source: Understood
pt_pt: Entendido
tr: Anlaşıldı

# document_choose
source: Choose a zip file with data for Tux Paint
pt_pt: Escolhe um ficheiro zip com dados para o Tux Paint
tr: Tux Paint için veriler içeren bir zip dosyası seçin

# Button_select
source: Select
pt_pt: Selecionar
tr: Seç

# textselect
source: Please select a file with the data to be imported.
pt_pt: Seleciona um ficheiro com os dados a importar.
tr: Lütfen içe aktarılacak verileri içeren bir dosya seçin.

# title_activity_import_data
source: ImportData
pt_pt: Importar dados
tr: Verileri içe aktar

source: Next
pt_pt: Seguinte
tr: İleri

source: Previous
pt_pt: Anterior
tr: Önceki

source: Selected file
pt_pt: Ficheiro selecionado
tr: Seçilen dosya

source: None
pt_pt: Nenhum
tr: Yok

source: Destination
pt_pt: Destino
tr: Hedef

source: Proceed
pt_pt: Continuar
tr: İlerle

# back_from_import
source: Back
pt_pt: Voltar
tr: Geri

# please_select
source: Please select a Zip file with data to be imported.
pt_pt: Seleciona um ficheiro Zip com os dados a importar.
tr: Lütfen içe aktarılacak verileri içeren bir zip dosyası seçin.

# Files_installed
source: The files have been installed correctly
pt_pt: Os ficheiros foram instalados corretamente
tr: Dosyalar doğru şekilde yüklendi

# Files_notinstalled
source: There has been some error, the files have not been installed.
pt_pt: Ocorreu um erro, os ficheiros não foram instalados.
tr: Bir hata oluştu, dosyalar yüklenmedi.

# BlueTooth_allowed
source: Access to BlueTooth is allowed
pt_pt: O acesso ao BlueTooth é permitido
tr: Bluetooth erişimine izin verildi

# BlueTooth_denied
source: Tux Paint has not access to BlueTooth
pt_pt: O Tux Paint não tem acesso ao BlueTooth
tr: Tux Paint'in Bluetooth erişimi yok

# requestrevoquebt
source: BlueTooth info
pt_pt: Informação BlueTooth
tr: Bluetooth bilgileri

source: Complexity
pt_pt: Complexidade
tr: Karmaşıklık

# Hide_Cursor
source: Cursor
tr: İmleç

# cursor_hide
source: Hide the cursor
tr: İmleci gizle

# cursor_show
source: Show the cursor
tr: İmleci göster

# stereo_enabled
source: Stereo
pt_pt: Estéreo
